# IdeaStatiCa.ConnectionApi.Model.ConConnection

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Id** | **int** |  | [optional]
**Identifier** | **string** |  | [optional]
**Name** | **string** |  | [optional]
**Description** | **string** |  | [optional]
**AnalysisType** | **ConAnalysisTypeEnum** |  | [optional]
**IncludeBuckling** | **bool** |  | [optional]
**SteelEdition** | **ConSteelCodeEditionEnum** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)